##$()和${}和$(())和(())

 

$()和${}的用法：

在 bash shell 中，$( ) 与 ` ` (反引号) 都是用来做命令替换用(command substitution)的。而 $( ) 并不见的每一种 shell 都能使用，若你用 bash2 的话，肯定没问题...

 

看 ${ } 吧... 它其实就是用来作变量替换用的啦。一般情况下，$var 与 ${var} 并没有啥不一样。但是用 ${ } 会比较精确的界定变量名称的范围。

 

我这里再用一些例子加以说明 ${ } 的一些特异功能：

假设我们定义了一个变量为：

file=/dir1/dir2/dir3/my.file.txt

我们可以用 ${ } 分别替换获得不同的值：

${file#*/}：拿掉第一条 / 及其左边的字符串：dir1/dir2/dir3/my.file.txt

${file##*/}：拿掉最后一条 / 及其左边的字符串：my.file.txt

${file#*.}：拿掉第一个 . 及其左边的字符串：file.txt

${file##*.}：拿掉最后一个 . 及其左边的字符串：txt

${file%/*}：拿掉最后条 / 及其右边的字符串：/dir1/dir2/dir3

${file%%/*}：拿掉第一条 / 及其右边的字符串：(空值)

${file%.*}：拿掉最后一个 . 及其右边的字符串：/dir1/dir2/dir3/my.file

${file%%.*}：拿掉第一个 . 及其右边的字符串：/dir1/dir2/dir3/my

记忆的方法为：

# 是去掉左边(在鉴盘上 # 在 $ 之左边)

% 是去掉右边(在鉴盘上 % 在 $ 之右边)

 

单一符号是最小匹配﹔两个符号是最大匹配。

${file:0:5}：提取最左边的 5 个字节：/dir1

${file:5:5}：提取第 5 个字节右边的连续 5 个字节：/dir2

 

我们也可以对变量值里的字符串作替换：

${file/dir/path}：将第一个 dir 提换为 path：/

path1/dir2/dir3/my.file.txt

${file//dir/path}：将全部 dir 提换为 path：/

path1/path2/path3/my.file.txt

 

利用 ${ } 还可针对不同的变量状态赋值(没设定、空值、非空值)：

${file-my.file.txt} ：假如 $file 没有设定，则使用 my.file.txt 作传回值。(空值及非空值时不作处理)

${file:-my.file.txt} ：假如 $file 没有设定或为空值，则使用my.file.txt 作传回值。 (非空值时不作处理)

${file+my.file.txt} ：假如 $file 设为空值或非空值，均使用my.file.txt作传回值。(没设定时不作处理)

${file:+my.file.txt} ：若 $file 为非空值，则使用 my.file.txt 作传回值。(没设定及空值时不作处理)

${file=my.file.txt} ：若 $file 没设定，则使用 my.file.txt 作传回值，同时将 $file 赋值为 my.file.txt 。 (空值及非空值时不作处理)

${file:=my.file.txt} ：若$file没设定或为空值，则使用my.file.txt作传回值，同时将 $file 赋值为my.file.txt 。(非空值时不作处理)

${file?my.file.txt} ：若 $file 没设定，则将 my.file.txt 输出至STDERR。 (空值及非空值时不作处理)

${file:?my.file.txt} ：若 $file 没设定或为空值，则将 my.file.txt 输出至 STDERR。 (非空值时不作处理)

以上的理解在于, 你一定要分清楚 unset 与 null 及 non-null 这三种赋值状态.

一般而言, : 与 null 有关, 若不带 : 的话, null 不受影响, 若带 : 则连null 也受影响.

 

还有哦，${#var} 可计算出变量值的长度：

${#file} 可得到 27 ，因为 /dir1/dir2/dir3/my.file.txt 刚好是 27 个字节...

 

 

$(())的用途：

它是用来作整数运算的。

在 bash 中，$(( )) 的整数运算符号大致有这些：

+ - * / ：分别为 "加、减、乘、除"。

% ：余数运算

& | ^ !：分别为 "AND、OR、XOR、NOT" 运算。

举例：

wangnc>a=5;b=7;c=2;

wangnc>echo $a + $b

5 + 7

wangnc>echo $(( a + b*c))

19

wangnc>echo $(((a*b)/c))

17

wangnc>echo $(($a +$b*$c))

19

wangnc>

 

在 $(( )) 中的变量名称，可于其前面加 $ 符号来替换，也可以不用，如：

$(( $a + $b * $c)) 也可得到 19 的结果

 

此外，$(( )) 还可作不同进位(如二进制、八进位、十六进制)作运算呢，只是，输出结果皆为十进制而已：

echo $((16#2a)) 结果为 42 (16进位转十进制)

 

 

(())的用途：

事实上，单纯用 (( )) 也可重定义变量值，或作 testing：

a=5; ((a++)) 可将 $a 重定义为 6

a=5; ((a--)) 则为 a=4

a=5; b=7; ((a < b)) 会得到 0 (true) 的返回值。

常见的用于 (( )) 的测试符号有如下这些：

<：小于

>：大于

<=：小于或等于

>=：大于或等于

==：等于

!=：不等于
